exampleCases/example.04.piso.DTU10MW.ALMAdvanced.refinements/system/controlDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       ABLSolver;

  libs              ("libuserfiniteVolume.so" "libuserincompressibleLESModels.so");

  startFrom         startTime;

  startTime         0.0;

  stopAt            endTime;

  endTime           1000.0;

  deltaT            0.20;

  writeControl      adjustableRunTime;

  writeInterval     99000.0; 

  purgeWrite        0;

  writeFormat       ascii;

  writePrecision    8;

  writeCompression  compressed;

  timeFormat        general;

  timePrecision     8;

  runTimeModifiable yes;

  adjustTimeStep    no;

  maxCo             0.75;

  maxDeltaT         25.0;

  startTimeMean     1000.0;

  startTimeCorr     1000.0;
  
  functions
  {
     #include "sampling/sliceDataInstantaneous"    
  }

// ************************************************************************* //

